In [2]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.1-cp37-cp37m-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.1

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.types import Integer, Text, String, DateTime, Float
import psycopg2

In [12]:
df = pd.read_csv('employee_normalization.csv', header=None) #read in csv

In [13]:
df

,0,1,2,3,4,5,6,7
0,123,Robert Bale,32,31 Pelham Drive,Houston,TX,77002,"robert.bale51231@gmail.com, robbieman512@gmail..."
1,456,Anya Strensa,25,142 Sunshine Road,Miami,FL,33101,"anya.strensa1412@gmail.com, soccergirl4251@gma..."
2,789,Arnold Tolenski,43,15 Silicon Avenue,San Francisco,CA,94016,arnold.tolenski5121@gmail.com

In [14]:
db_name = 'normalization_db'  #specify db
table_name = 'employee_normalization'  #specify table

In [15]:
#connect python to pgAdmin
connect_string ='postgresql://postgres:postgres@localhost:5432/{}'\
                .format(db_name)

sql_engine = create_engine(connect_string)

In [16]:
df.to_sql(name=table_name, con=sql_engine, 
         if_exists='replace', 
         index=False,
         dtype={'employee_id':Integer, #create table schema
              'name':Text, 
              'age':Text,
              'address':Text,
                'city':Text,
               'state':Text,
               'zip_code':Text,
               'email':Text}
         )

In [17]:
query = 'select * from {}'.format(table_name)

pd.read_sql_query(query, sql_engine)

,0,1,2,3,4,5,6,7
0,123,Robert Bale,32,31 Pelham Drive,Houston,TX,77002,"robert.bale51231@gmail.com, robbieman512@gmail..."
1,456,Anya Strensa,25,142 Sunshine Road,Miami,FL,33101,"anya.strensa1412@gmail.com, soccergirl4251@gma..."
2,789,Arnold Tolenski,43,15 Silicon Avenue,San Francisco,CA,94016,arnold.tolenski5121@gmail.com